tap "fluxcd/tap"
tap "valkyrie00/bbrew"
brew "atuin"
brew "azure-cli"
brew "bash-preexec"
brew "bat"
brew "block-goose-cli"
brew "btop"
brew "chezmoi"
brew "direnv"
brew "dysk"
brew "eza"
brew "fd"
brew "gemini-cli"
brew "gh"
brew "huggingface-cli"
brew "k9s"
brew "kubent"
brew "mise"
brew "neovim"
brew "nfcutils"
brew "ripgrep"
brew "starship"
brew "talosctl"
brew "tealdeer"
brew "trash-cli"
brew "ugrep"
brew "uutils-coreutils"
brew "yq"
brew "zoxide"
brew "fluxcd/tap/flux"
brew "valkyrie00/bbrew/bbrew"
cask "font-0xproto-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-ubuntu-nerd-font"
cask "prince"
vscode "bierner.markdown-mermaid"
vscode "enkia.tokyo-night"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-xml"
vscode "shd101wyy.markdown-preview-enhanced"
cargo "rustormy"
flatpak "be.alexandervanhee.gradia"
flatpak "com.bitwarden.desktop"
flatpak "com.calibre_ebook.calibre"
flatpak "com.discordapp.Discord"
flatpak "com.github.PintaProject.Pinta"
flatpak "com.github.flxzt.rnote"
flatpak "com.github.johnfactotum.Foliate"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.jeffser.Alpaca"
flatpak "com.ktechpit.torrhunt"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "com.obsproject.Studio"
flatpak "com.rafaelmardojai.Blanket"
flatpak "com.ranfdev.DistroShelf"
flatpak "com.rawtherapee.RawTherapee"
flatpak "com.spotify.Client"
flatpak "com.synology.SynologyDrive"
flatpak "com.valvesoftware.Steam"
flatpak "de.leopoldluley.Clapgrep"
flatpak "dev.bragefuglseth.Keypunch"
flatpak "dev.geopjr.Calligraphy"
flatpak "fm.reaper.Reaper"
flatpak "io.github.flattool.Ignition"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.getnf.embellish"
flatpak "io.github.kolunmi.Bazaar"
flatpak "io.github.lainsce.Colorway"
flatpak "io.github.nokse22.asciidraw"
flatpak "io.github.ronniedroid.concessio"
flatpak "io.gitlab.adhami3310.Impression"
flatpak "io.gitlab.theevilskeleton.Upscaler"
flatpak "io.missioncenter.MissionCenter"
flatpak "io.podman_desktop.PodmanDesktop"
flatpak "it.mijorus.smile"
flatpak "md.obsidian.Obsidian"
flatpak "me.iepure.devtoolbox"
flatpak "me.proton.Mail"
flatpak "org.audacityteam.Audacity"
flatpak "org.blender.Blender"
flatpak "org.freecad.FreeCAD"
flatpak "org.freedesktop.Bustle"
flatpak "org.gimp.GIMP"
flatpak "org.gnome.Calculator"
flatpak "org.gnome.Calendar"
flatpak "org.gnome.Characters"
flatpak "org.gnome.Connections"
flatpak "org.gnome.Contacts"
flatpak "org.gnome.DejaDup"
flatpak "org.gnome.FileRoller"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.Logs"
flatpak "org.gnome.Loupe"
flatpak "org.gnome.Maps"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.Papers"
flatpak "org.gnome.Showtime"
flatpak "org.gnome.SimpleScan"
flatpak "org.gnome.Snapshot"
flatpak "org.gnome.TextEditor"
flatpak "org.gnome.Weather"
flatpak "org.gnome.baobab"
flatpak "org.gnome.clocks"
flatpak "org.gnome.dspy"
flatpak "org.gnome.font-viewer"
flatpak "org.inkscape.Inkscape"
flatpak "org.kde.haruna"
flatpak "org.kde.kdenlive"
flatpak "org.kde.krita"
flatpak "org.localsend.localsend_app"
flatpak "org.mozilla.Thunderbird"
flatpak "org.mozilla.firefox"
flatpak "org.musescore.MuseScore"
flatpak "org.onlyoffice.desktopeditors"
flatpak "org.pipewire.Helvum"
flatpak "org.qbittorrent.qBittorrent"
flatpak "org.sdrangel.SDRangel"
flatpak "org.torproject.torbrowser-launcher"
flatpak "org.videolan.VLC"
flatpak "page.tesk.Refine"
